# Даны числа x и y. Получить x − y / 1 + xy

x = int(input("Введите число x: "))
y = int(input("Введите число y: "))

formula = (x - y) / 1 + x * y

print(formula)
