# Даны 2 числа a и b. Получить их сумму, разность и произведение

a = int(input("Введите число а: "))
b = int(input("Введите число b: "))

sum_of_variables = a + b
subtraction = a - b
multiplication = a * b

print(f'Сумма чисел равна {sum_of_variables}\n'
      f'Разность чисел равна {subtraction}\n'
      f'Произведение чисел равно {multiplication}')
